MetaWatchOpenProjects/MetaWatch-Gen2/Common/Hardware/OSAL/MSP430FlashUtil.c
/**************************************************************************************************
  Filename:       MSP430FlashUtil.c

  Description:    Describe the purpose and contents of the file.


  Copyright 2006-2007 Texas Instruments Incorporated. All rights reserved.

  IMPORTANT: Your use of this Software is limited to those specific rights
  granted under the terms of a software license agreement between the user
  who downloaded the software, his/her employer (which must be your employer)
  and Texas Instruments Incorporated (the "License").  You may not use this
  Software unless you agree to abide by the terms of the License. The License
  limits your use, and you acknowledge, that the Software may not be modified,
  copied or distributed unless embedded on a Texas Instruments microcontroller
  or used solely and exclusively in conjunction with a Texas Instruments radio
  frequency transceiver, which is integrated into your product.  Other than for
  the foregoing purpose, you may not use, reproduce, copy, prepare derivative
  works of, modify, distribute, perform, display or sell this Software and/or
  its documentation for any purpose.

  YOU FURTHER ACKNOWLEDGE AND AGREE THAT THE SOFTWARE AND DOCUMENTATION ARE
  PROVIDED “AS IS” WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESS OR IMPLIED, 
  INCLUDING WITHOUT LIMITATION, ANY WARRANTY OF MERCHANTABILITY, TITLE, 
  NON-INFRINGEMENT AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT SHALL
  TEXAS INSTRUMENTS OR ITS LICENSORS BE LIABLE OR OBLIGATED UNDER CONTRACT,
  NEGLIGENCE, STRICT LIABILITY, CONTRIBUTION, BREACH OF WARRANTY, OR OTHER
  LEGAL EQUITABLE THEORY ANY DIRECT OR INDIRECT DAMAGES OR EXPENSES
  INCLUDING BUT NOT LIMITED TO ANY INCIDENTAL, SPECIAL, INDIRECT, PUNITIVE
  OR CONSEQUENTIAL DAMAGES, LOST PROFITS OR LOST DATA, COST OF PROCUREMENT
  OF SUBSTITUTE GOODS, TECHNOLOGY, SERVICES, OR ANY CLAIMS BY THIRD PARTIES
  (INCLUDING BUT NOT LIMITED TO ANY DEFENSE THEREOF), OR OTHER SIMILAR COSTS.

  Should you have any questions regarding your right to use this Software,
  contact Texas Instruments Incorporated at www.TI.com. 
**************************************************************************************************/

#include "hal_board_type.h"
#include "macro.h"

#include "MSP430FlashUtil.h"

static unsigned char SavedWatchdogSetting;

#define START_FLASH_CYCLE() {            \
  SavedWatchdogSetting =  WDTCTL & 0xFF; \
  WDTCTL = WDTPW + WDTHOLD;              \
}
  
#define END_FLASH_CYCLE() {              \
  WDTCTL = WDTPW + SavedWatchdogSetting; \
}

void flashErasePage(unsigned char *addr)
{
  ENTER_CRITICAL_REGION_SLOW();
  START_FLASH_CYCLE();
  
  FCTL1 = FWKEY + ERASE;               // Set Erase bit
  FCTL3 = FWKEY;                       // Clear Lock bit
  *addr = 0;                           // Dummy write to erase Flash segment
  FCTL1 = FWKEY;                       // Clear ERASE bit
  FCTL3 = FWKEY + LOCK;                // Set LOCK bit

  END_FLASH_CYCLE();
  LEAVE_CRITICAL_REGION_SLOW();
}

void flashWrite( unsigned char *addr, unsigned int len, unsigned char *buf )
{
  ENTER_CRITICAL_REGION_SLOW();
  START_FLASH_CYCLE();

  FCTL3 = FWKEY;                // Clear Lock bit
  FCTL1 = FWKEY + WRT;          // Set WRT bit for write operation

  while ( len-- )
  {
    *addr++ = *buf++;            // Write value to flash
  }

  FCTL1 = FWKEY;                // Clear WRT bit
  FCTL3 = FWKEY + LOCK;         // Set LOCK bit

  END_FLASH_CYCLE();
  LEAVE_CRITICAL_REGION_SLOW();
}

/*********************************************************************
*********************************************************************/
